{"_id":{"$oid":"61688c7e38e6de2bcb26f2e6"},"Title":"Silence of the Lambs","Description":"A young FBI cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Jonathan Demme","Bio":"Robert Jonathan Demme was an American director, producer, and screenwriter.","Birth":"1944","Death":"2017"},"ImagePath":"silenceofthelambs.png","Featured":true}
{"_id":{"$oid":"61688c7e38e6de2bcb26f2e7"},"Title":"Hook","Description":"When Captain James Hook kidnaps his children, an adult Peter Pan must return to Neverland and reclaim his youthful spirit in order to challenge his old enemy.","Genre":{"Name":"Adventure","Description":"Adventure films are a genre of film whose plots feature elements of travel. They typically involve protagonists who must leave their home or place of comfort and go to far away lands to fulfill a goal. Settings play an important role in Adventure films, sometimes as big as the characters themselves."},"Director":{"Name":"Steven Spielberg","Bio":"One of the most influential personalities in the history of cinema, Steven Spielberg is Hollywood's best known director and one of the wealthiest filmmakers in the world. ","Birth":"1946"},"ImageURL":"https://m.media-amazon.com/images/M/MV5BNmJjNTQzMjctMmE2NS00ZmYxLWE1NjYtYmRmNjNiMzljOTc3XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_UX182_CR0,0,182,268_AL_.jpg","Featured":true}
{"_id":{"$oid":"61688c7e38e6de2bcb26f2e8"},"Title":"States of Grace","Description":"The lives of a street preacher, an aspiring actress, a Mormon missionary, and a young gang banger intersect in this ensemble drama set in present-day Santa Monica, California.","Genre":{"Name":"Drama","Description":"In film and television, drama is a category of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"Director":{"Name":"Richard Dutcher","Bio":"American independent filmmaker Richard Dutcher, although still relatively young in his career, is known primarily as the 'father of Mormon Cinema'. His first widely released theatrical feature, God's Army (2000), told the story of several Mormon missionaries in Los Angeles. Produced for only $300,000, 'God's Army' grossed over $2.6 million at the U.S. box office, sold over 100,000 videos, and single-handedly launched a new genre: Mormon Cinema.","Birth":1964.0},"ImageURL":"https://m.media-amazon.com/images/M/MV5BMjEwNjg3NTE3OV5BMl5BanBnXkFtZTcwOTk1MzIzMQ@@._V1_UY268_CR0,0,182,268_AL_.jpg","Featured":false}
{"_id":{"$oid":"61688c7e38e6de2bcb26f2e9"},"Title":"The Princess Bride","Description":"While home sick in bed, a young boy's grandfather reads him the story of a farmboy-turned-pirate who encounters numerous obstacles, enemies and allies in his quest to be reunited with his true love.","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist or protagonists are thrust into a series of events that typically include violence, extended fighting, physical feats, rescues and frantic chases. Action films tend to feature a mostly resourceful hero struggling against incredible odds, which include life-threatening situations, a dangerous villain, or a pursuit which usually concludes in victory for the hero."},"Director":{"Name":"Rob Reiner","Bio":"When Rob graduated high school, his parents advised him to participate in Summer Theatre. Reiner got a job as an apprentice in the Bucks County Playhouse in Pennsylvania. He went to be further educated at UCLA Film School. Reiner felt he still wasn't successful even having a recurring role on one of the biggest shows in the country, All in the Family. Reiner began his directing career with the Oscar-nominated films This Is Spinal Tap, Stand By Me, and The Princess Bride.","Birth":1947.0},"ImageURL":"https://m.media-amazon.com/images/M/MV5BMGM4M2Q5N2MtNThkZS00NTc1LTk1NTItNWEyZjJjNDRmNDk5XkEyXkFqcGdeQXVyMjA0MDQ0Mjc@._V1_UX182_CR0,0,182,268_AL_.jpg","Featured":false}
{"_id":{"$oid":"61688c7e38e6de2bcb26f2ea"},"Title":"Signs","Description":"When ALIENS visit a family, they don't like it and get mad at them. Then everyone fights everyone else.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that evokes excitement and suspense in the audience. The suspense element found in most films' plots is particularly exploited by the filmmaker in this genre. Tension is created by delaying what the audience sees as inevitable, and is built through situations that are menacing or where escape seems impossible."},"Director":{"Name":"M. Night Shyamalan","Bio":"This guy was well beloved until the travesty that was the Avatar movie. He really kinda jumped the shark on that one, mostly owing to the fact that it was terrible and everyone hated it. He's still trying to claw his way back into our good graces.","Birth":1970.0},"ImageURL":"https://m.media-amazon.com/images/M/MV5BNDUwMDUyMDAyNF5BMl5BanBnXkFtZTYwMDQ3NzM3._V1_UX182_CR0,0,182,268_AL_.jpg","Featured":false}
{"_id":{"$oid":"61688c7e38e6de2bcb26f2eb"},"Title":"The Sixth Sense","Description":"A boy who communicates with spirits seeks the help of a disheartened child psychologist.","Genre":{"Name":"Drama","Description":"In film and television, drama is a category of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"Director":{"Name":"M. Night Shyamalan","Bio":"Born in Puducherry, India, and raised in the posh suburban Penn Valley area of Philadelphia, Pennsylvania, M. Night Shyamalan is a film director, screenwriter, producer, and occasional actor, known for making movies with contemporary supernatural plots.","Birth":1970.0},"ImageURL":"https://m.media-amazon.com/images/M/MV5BMWM4NTFhYjctNzUyNi00NGMwLTk3NTYtMDIyNTZmMzRlYmQyXkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1_UX182_CR0,0,182,268_AL_.jpg","Featured":false}
{"_id":{"$oid":"61688c7e38e6de2bcb26f2ec"},"Title":"The Fountain","Description":"As a modern-day scientist, Tommy is struggling with mortality, desperately searching for the medical breakthrough that will save the life of his cancer-stricken wife, Izzi.","Genre":{"Name":"Drama","Description":"In film and television, drama is a category of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"Director":{"Name":"Darren Aronofsky","Bio":"Darren Aronofsky was born February 12, 1969, in Brooklyn, New York. Growing up, Darren was always artistic: he loved classic movies and, as a teenager, he even spent time doing graffiti art. After high school, Darren went to Harvard University to study film (both live-action and animation). He won several film awards after completing his senior thesis film, Supermarket Sweep, starring Sean Gullette, which went on to becoming a National Student Academy Award finalist. Aronofsky didn't make a feature film until five years later, in February 1996, where he began creating the concept for Pi (1998). After Darren's script for Pi (1998) received great reactions from friends, he began production. The film re-teamed Aronofsky with Gullette, who played the lead. This went on to further successes, such as Requiem for a Dream (2000), The Wrestler (2008) and Black Swan (2010). Most recently, he completed the films Noah (2014) and Mother! (2017).","Birth":1969.0},"ImageURL":"https://m.media-amazon.com/images/M/MV5BMTU5OTczMTcxMV5BMl5BanBnXkFtZTcwNDg3MTEzMw@@._V1_UX182_CR0,0,182,268_AL_.jpg","Featured":false}
{"_id":{"$oid":"61688c7e38e6de2bcb26f2ed"},"Title":"Thor: Ragnarok","Description":"Imprisoned on the planet Sakaar, Thor must race against time to return to Asgard and stop Ragnarök, the destruction of his world, at the hands of the powerful and ruthless villain Hela.","Genre":{"Name":"Adventure","Description":"Adventure films are a genre of film whose plots feature elements of travel. They typically involve protagonists who must leave their home or place of comfort and go to far away lands to fulfill a goal. Settings play an important role in Adventure films, sometimes as big as the characters themselves."},"Director":{"Name":"Taika Waititi","Bio":"Taika Waititi, also known as Taika Cohen, hails from the Raukokore region of the East Coast of New Zealand, and is the son of Robin (Cohen), a teacher, and Taika Waiti, an artist and farmer. His father is Maori (Te-Whanau-a-Apanui), and his mother is of Ashkenazi Jewish, Irish, Scottish, and English descent. Taika has been involved in the film industry for several years, initially as an actor, and now focusing on writing and directing.","Birth":1975.0},"ImageURL":"https://m.media-amazon.com/images/M/MV5BMjMyNDkzMzI1OF5BMl5BanBnXkFtZTgwODcxODg5MjI@._V1_UX182_CR0,0,182,268_AL_.jpg","Featured":false}
{"_id":{"$oid":"61688c7e38e6de2bcb26f2ee"},"Title":"Back to the Future Part II","Description":"After visiting 2015, Marty McFly must repeat his visit to 1955 to prevent disastrous changes to 1985...without interfering with his first trip.","Genre":{"Name":"Adventure","Description":"Adventure films are a genre of film whose plots feature elements of travel. They typically involve protagonists who must leave their home or place of comfort and go to far away lands to fulfill a goal. Settings play an important role in Adventure films, sometimes as big as the characters themselves."},"Director":{"Name":"Robert Zemeckis","Bio":"A whiz-kid with special effects, Robert is from the Spielberg camp of film-making (Steven Spielberg produced many of his films). Usually working with writing partner Bob Gale, Robert's earlier films show he has a talent for zany comedy (Romancing the Stone (1984), 1941 (1979)) and special effect vehicles (Who Framed Roger Rabbit (1988) and Back to the Future (1985)). His later films have become more serious, with the hugely successful Tom Hanks vehicle Forrest Gump (1994) and the Jodie Foster film Contact (1997), both critically acclaimed movies. Again, these films incorporate stunning effects. Robert has proved he can work a serious story around great effects.","Birth":1951.0},"ImageURL":"https://m.media-amazon.com/images/M/MV5BZTMxMGM5MjItNDJhNy00MWI2LWJlZWMtOWFhMjI5ZTQwMWM3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_UX182_CR0,0,182,268_AL_.jpg","Featured":false}
{"_id":{"$oid":"61688c7e38e6de2bcb26f2ef"},"Title":"States of Grace","Description":"The lives of a street preacher, an aspiring actress, a Mormon missionary, and a young gang banger intersect in this ensemble drama set in present-day Santa Monica, California.","Genre":{"Name":"Drama","Description":"In film and television, drama is a category of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"Director":{"Name":"Richard Dutcher","Bio":"American independent filmmaker Richard Dutcher, although still relatively young in his career, is known primarily as the 'father of Mormon Cinema'. His first widely released theatrical feature, God's Army (2000), told the story of several Mormon missionaries in Los Angeles. Produced for only $300,000, 'God's Army' grossed over $2.6 million at the U.S. box office, sold over 100,000 videos, and single-handedly launched a new genre: Mormon Cinema.","Birth":1964.0},"ImageURL":"https://m.media-amazon.com/images/M/MV5BMjEwNjg3NTE3OV5BMl5BanBnXkFtZTcwOTk1MzIzMQ@@._V1_UY268_CR0,0,182,268_AL_.jpg","Featured":false}
